ТОИР_демо/src/Documents/торо_УстановкаСтоимостейКвалификаций/торо_УстановкаСтоимостейКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаСтоимостейКвалификаций</name>
  <registerRecords>InformationRegister.торо_СтоимостьЧасаКвалификации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтоимостьЧаса</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНормочаса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_СтоимостьЧасаКвалификации/торо_СтоимостьЧасаКвалификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтоимостьЧасаКвалификации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_УстановкаСтоимостейКвалификаций/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СтоимостьЧаса.Количество() = 0 Тогда
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе не заполнена табличная часть стоимостей часа. Проведение невозможно!'"));
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполненно значение поля ""Организация""!'"), СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Движения.торо_СтоимостьЧасаКвалификации.Записывать = Истина;
	Движения.торо_СтоимостьЧасаКвалификации.Очистить();
	Для Каждого ТекСтрокаСтоимость Из СтоимостьЧаса Цикл
		Движение = Движения.торо_СтоимостьЧасаКвалификации.Добавить();
		Движение.Период = Дата;
		Движение.Валюта = ТекСтрокаСтоимость.Валюта;
		Движение.Стоимость = ТекСтрокаСтоимость.СтоимостьНормочаса;
		Движение.Квалификация = ТекСтрокаСтоимость.Квалификация;
	КонецЦикла;


КонецПроцедуры
#КонецОбласти

#КонецЕсли
